{
  "introduction": {
    "learnMore": "Saiba mais",
    "btns": {
      "about": "Sobre mim",
      "resume": "Currículo"
    },
    "links": {
      "linkedInTitle": "Meu perfil no LinkedIn",
      "githubTitle": "Meu perfil no Github"
    }
  },
  "about": {
    "title": {
      "greeting": "Olá!",
      "name": "Eu sou Isaque!"
    },
    "subTitle": "Apaixonado por criar soluções web e entusiasta de IA, sempre explorando novas maneiras de inovar e otimizar processos.",
    "firstParagraph": "Sou um desenvolvedor web full stack com ampla experiência em front-end. Tenho conhecimentos sólidos em jQuery, React, Next.js e experiência com Gatsby, o que me permite criar interfaces intuitivas e dinâmicas, aplicando as melhores práticas e tecnologias atuais.",
    "secondParagraph": "No back-end, atuo com Node.js e Python para desenvolver APIs REST e processos automatizados de ETL. Também possuo experiência com Java, possibilitando a construção de serviços robustos. Meu conhecimento aprofundado em bancos de dados relacionais, especialmente SQL Server, me permite gerenciar e integrar dados de forma eficaz em sistemas complexos.",
    "thirdParagraph": "Como engenheiro de software, priorizo a criação de soluções escaláveis e sustentáveis, escrevendo código limpo e bem estruturado. Além disso, sou um entusiasta de IA, sempre em busca de novas tecnologias para transformar processos e impulsionar a inovação no desenvolvimento de software."
  },
  "experiences": {
    "title": "Experiências",
    "subTitle": "Algumas de minhas vivências como desenvolvedor e estudante",
    "card1date": "Janeiro, 2020",
    "card1title": "Introdução ao mundo do desenvolvimento",
    "card1description": "Meu primeiro 'Hello World'. Foi a partir desse momento que iniciei meus estudos autodidatas.",
    "card2date": "Março, 2020",
    "card2title": "Desenvolvimento de projetos pessoais",
    "card2description": "Após construir uma base sólida, aprofundei meus estudos através do desenvolvimento de projetos pessoais.",
    "card3date": "Janeiro, 2021",
    "card3title": "Início da Faculdade",
    "card3description": "Após um ano de estudos autodidatas e aprimoramento das minhas habilidades, ingressei na Faculdade de Análise e Desenvolvimento de Software na Universidade Cruzeiro do Sul.",
    "card4date": "Junho, 2021",
    "card4title": "Primeira experiência profissional",
    "card4description": "Iniciei minha carreira profissional atuando como desenvolvedor full stack, criando e aprimorando aplicativos web.",
    "card5date": "Janeiro, 2022",
    "card5title": "Ingresso na 4MapIT",
    "card5description": "Atuei como analista de sistemas, realizando levantamento de requisitos, modelagem de sistemas e desenvolvimento de aplicativos web full stack com jQuery, Node.js e SQL Server.",
    "card6date": "Janeiro, 2023",
    "card6title": "Formatura da Faculdade",
    "card6description": "Concluí a graduação em Análise de Sistemas, aprofundando meus conhecimentos em bancos de dados, desenvolvimento web e mobile, e fortalecendo minha base em engenharia de software.",
    "card7date": "Presente",
    "card7title": "O que faço agora?",
    "card7description": "Atualmente, trabalho em tempo integral como analista de sistemas na Octea. Nas horas vagas, atuo como freelancer e continuo me aprimorando em diversas áreas da tecnologia, como desenvolvimento web, data science e machine learning.",
    "present": "Presente",
    "resume": {
      "title": "Veja meu currículo",
      "text": "Meu Currículo"
    }
  },
  "projects": {
    "title": "Meus Projetos",
    "subTitle": "Alguns dos meus projetos pessoais e profissionais",
    "slideTip": "Dica: Deslize ou clique em 'próximo' para visualizar mais projetos"
  },
  "contact": {
    "title": "Entre em contato",
    "subTitle": "Tem alguma dúvida, proposta ou deseja apenas dizer olá? Vamos conversar!",
    "inputNamePlaceholder": "Insira seu nome",
    "inputEmailPlaceholder": "Insira seu email",
    "inputMessagePlaceholder": "Escreva sua mensagem aqui",
    "inputButton": "Enviar",
    "success": "E-mail enviado! Entrarei em contato assim que possível :D",
    "errors": {
      "name": "Nome deverá conter no mínimo 3 caracteres",
      "email": "Email inválido",
      "message": "A mensagem deverá conter no mínimo 10 caracteres"
    }
  },
  "resume": {
    "myInfo": {
      "role": "Engenheiro de Software / Desenvolvedor Full Stack",
      "location": "São Paulo, Brasil"
    },
    "subtitle": "Apaixonado por criar soluções web e entusiasta de IA, sempre explorando novas maneiras de inovar e otimizar processos.",
    "links": {
      "linkedInTitle": "Meu perfil no LinkedIn",
      "githubTitle": "Meu perfil no Github",
      "emailTitle": "Envie-me um e-mail",
      "downloadTitle": "Baixar Currículo",
      "downloadText": "Download"
    },
    "aside": {
      "portfolio": "Isaque | Portfólio",
      "skills": {
        "core": {
          "title": "Habilidades Principais"
        },
        "others": {
          "title": "Outras Habilidades",
          "skills": {
            "one": "Modelagem de Sistemas",
            "two": "Design Responsivo",
            "three": "Otimização de Performance",
            "four": "Processo ETL",
            "five": "Código Limpo",
            "six": "API REST",
            "seven": "DDD",
            "eight": "CI/CD"
          }
        }
      }
    },
    "experiences": {
      "title": "Experiências",
      "subtitle": "Atuei em diversos projetos web ao longo dos anos, contribuindo para organizações de diferentes portes:",
      "jobs": {
        "one": {
          "role": "Desenvolvedor Full Stack",
          "period": "Março - Junho 2021",
          "description": "Responsável por desenvolver aplicações web do zero e implementar novas funcionalidades em sistemas existentes. Atuei na análise de requisitos, desenvolvimento front-end e back-end, garantindo a integração eficiente entre diversas plataformas e utilizando práticas ágeis para entregar soluções escaláveis.",
          "activities": {
            "one": "Desenvolvimento e suporte de funcionalidades front-end utilizando React.js, Next.js e Gatsby.js.",
            "two": "Criação e manutenção de funcionalidades back-end com Node.js, Express.js, Koa.js e Nest.js.",
            "three": "Utilização de serviços em nuvem, como AWS (EC2, SES, Lambda)."
          }
        },
        "two": {
          "role": "Analista/Desenvolvedor de Sistemas",
          "period": "Janeiro 2022 - Junho 2023",
          "description": "Atuei como analista e desenvolvedor full stack, criando sistemas complexos e oferecendo suporte a soluções existentes. Responsável pela análise de requisitos, criação de interfaces, desenvolvimento de APIs, processos automatizados, tarefas agendadas e modelagem de bancos de dados relacionais.",
          "activities": {
            "one": "Desenvolvimento e suporte de funcionalidades front-end utilizando jQuery.",
            "two": "Criação e manutenção de APIs REST com Node.js.",
            "three": "Desenvolvimento de processos e estruturas com SQL Server.",
            "four": "Análise de requisitos e modelagem de sistemas."
          }
        },
        "three": {
          "role": "Analista/Desenvolvedor de Sistemas",
          "period": "Junho 2023 - Presente",
          "description": "Atualmente, atuo como analista de sistemas e desenvolvedor full stack, idealizando e implementando sistemas complexos desde o início. Contribuo na análise de requisitos, criação de interfaces, desenvolvimento de APIs e processos automatizados, além da modelagem de bancos de dados relacionais.",
          "activities": {
            "one": "Idealização e desenvolvimento de aplicações do zero utilizando das melhores práticas, como DDD, SOLID, Design Patterns, Clean Architecture, etc.",
            "two": "Validação de PRs e gestão de releases.",
            "three": "Implementação e gerenciamento de filas de mensageria com RabbitMQ.",
            "four": "Análise e modelagem de sistemas.",
            "five": "Automatização de processos manuais, aumentando a produtividade.",
            "six": "Criação de processos ETL com Python e SQL Server.",
            "seven": "Apoio técnico à equipe e suporte em regras de negócio.",
            "eight": "Gestão de recursos de nuvem com Azure (VMs, Storage, gestão de domínios, etc.).",
            "nine": "Criação de pipelines de CI/CD com Azure DevOps."
          }
        }
      }
    },
    "projects": {
      "title": "Projetos",
      "text": "Links para alguns dos meus trabalhos podem ser encontrados em isaquedev/projects. Detalhes adicionais podem ser fornecidos mediante solicitação e agendamento de uma demonstração."
    },
    "errors": {
      "generateResume": "Falha ao gerar currículo",
      "localeNotProvided": "Linguagem não fornecida"
    },
    "loadingSpinner": {
      "message": "Gerando currículo..."
    }
  },
  "navbar": {
    "about": "Sobre",
    "experiences": "Experiências",
    "projects": "Projetos",
    "resume": "Meu Currículo",
    "sayHello": "Diga Olá!",
    "links": {
      "githubTitle": "Meu Github",
      "linkedInTitle": "Meu LinkedIn"
    },
    "menuButton": {
      "open": "Abrir Menu",
      "close": "Fechar Menu"
    },
    "accessibility": {
      "title": "Acessibilidade",
      "theme": {
        "dark": "Mudar para o modo escuro",
        "light": "Mudar para o modo claro"
      },
      "languages": {
        "english": "Inglês",
        "portuguese": "Português"
      }
    }
  },
  "footer": {
    "copyright": "Copyright © 2024 Isaque Duarte",
    "whatsappLink": "https://wa.me/5511964957516?text=Ol%C3%A1%2C%20gostaria%20de%20realizar%20uma%20consultoria"
  },
  "loadingSpinner": {
    "message": "Carregando..."
  }
}
